<details ><summary>apply for portal 2024-12-18 08:30:40 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.proxysql.module.proxysql_deployment.akash_deployment.service will be destroyed
  # (because akash_deployment.service is not in configuration)
  - resource "akash_deployment" "service" {
      - deployment_dseq               = "19388728" -> null
      - deployment_gseq               = "1" -> null
      - deployment_oseq               = "1" -> null
      - deployment_owner              = "akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc" -> null
      - deployment_state              = "active" -> null
      - escrow_account_balance_amount = "485822.000000000000000000" -> null
      - escrow_account_balance_denom  = "uakt" -> null
      - escrow_account_owner          = "akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc" -> null
      - id                            = "19388728:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
      - provider_address              = "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
      - sdl                           = (sensitive value) -> null
      - services                      = [
          - {
              - available          = 1
              - available_replicas = 1
              - forwarded_ports    = [
                  - {
                      - external_port = 31746
                      - host          = "provider.ny-01.node.infra.lumeweb.com"
                      - port          = 6033
                      - proto         = "TCP"
                    },
                ]
              - ips                = []
              - name               = "portal-proxysql-testing-ecd063cb"
              - ready_replicas     = 1
              - replicas           = 1
              - total              = 1
              - updated_replicas   = 1
              - uris               = []
            },
        ] -> null

      - provider_filters {
          - enforce   = true -> null
          - providers = [
              - "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ] -> null
        }
    }

  # module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service will be destroyed
  # (because akash_deployment.service is not in configuration)
  - resource "akash_deployment" "service" {
      - deployment_dseq               = "19388725" -> null
      - deployment_gseq               = "1" -> null
      - deployment_oseq               = "1" -> null
      - deployment_owner              = "akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc" -> null
      - deployment_state              = "active" -> null
      - escrow_account_balance_amount = "485822.000000000000000000" -> null
      - escrow_account_balance_denom  = "uakt" -> null
      - escrow_account_owner          = "akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc" -> null
      - id                            = "19388725:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
      - provider_address              = "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
      - sdl                           = (sensitive value) -> null
      - services                      = [
          - {
              - available          = 1
              - available_replicas = 1
              - forwarded_ports    = [
                  - {
                      - external_port = 30282
                      - host          = "provider.ny-01.node.infra.lumeweb.com"
                      - port          = 3306
                      - proto         = "TCP"
                    },
                ]
              - ips                = []
              - name               = "portal-mysql-node-0-testing-f676881b"
              - ready_replicas     = 1
              - replicas           = 1
              - total              = 1
              - updated_replicas   = 1
              - uris               = []
            },
        ] -> null

      - provider_filters {
          - enforce   = true -> null
          - providers = [
              - "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ] -> null
        }
    }

  # module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service will be destroyed
  # (because akash_deployment.service is not in configuration)
  - resource "akash_deployment" "service" {
      - deployment_dseq               = "19388723" -> null
      - deployment_gseq               = "1" -> null
      - deployment_oseq               = "1" -> null
      - deployment_owner              = "akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc" -> null
      - deployment_state              = "active" -> null
      - escrow_account_balance_amount = "485822.000000000000000000" -> null
      - escrow_account_balance_denom  = "uakt" -> null
      - escrow_account_owner          = "akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc" -> null
      - id                            = "19388723:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
      - provider_address              = "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
      - sdl                           = (sensitive value) -> null
      - services                      = [
          - {
              - available          = 1
              - available_replicas = 1
              - forwarded_ports    = [
                  - {
                      - external_port = 30138
                      - host          = "provider.ny-01.node.infra.lumeweb.com"
                      - port          = 3306
                      - proto         = "TCP"
                    },
                ]
              - ips                = []
              - name               = "portal-mysql-node-1-testing-fd97dcbc"
              - ready_replicas     = 1
              - replicas           = 1
              - total              = 1
              - updated_replicas   = 1
              - uris               = []
            },
        ] -> null

      - provider_filters {
          - enforce   = true -> null
          - providers = [
              - "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ] -> null
        }
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19388737:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19388731:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  + mysql_endpoint             = (known after apply)
  - proxysql_endpoint          = "provider.ny-01.node.infra.lumeweb.com:31746" -> null
module.proxysql.module.proxysql_deployment.akash_deployment.service: Destroying... [id=19388728:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.proxysql.module.proxysql_deployment.akash_deployment.service: Destruction complete after 10s
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Destroying... [id=19388723:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service: Destroying... [id=19388725:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service: Still destroying... [id=19388725:1:1:akash1pvy8zyzqwz2r2jl9j9d3...jukxttwauvnty679l720ey87ya5sgjv4j9tstn, 10s elapsed]
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Still destroying... [id=19388723:1:1:akash1pvy8zyzqwz2r2jl9j9d3...jukxttwauvnty679l720ey87ya5sgjv4j9tstn, 10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Destruction complete after 11s
module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service: Destruction complete after 18s
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 38s [id=19406080:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Modifying... [id=19388731:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still modifying... [id=19388731:1:1:akash1pvy8zyzqwz2r2jl9j9d3...jukxttwauvnty679l720ey87ya5sgjv4j9tstn, 10s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Modifications complete after 11s [id=19388731:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Modifying... [id=19388737:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Modifications complete after 6s [id=19388737:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

Apply complete! Resources: 1 added, 2 changed, 3 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:31613"
renterd_autopilot_endpoint = "autopilot.portal-renterd-cluster.node.testing.pinner.xyz"
renterd_bus_endpoint = "bus.portal-renterd-cluster.node.testing.pinner.xyz"
renterd_workers_endpoints = [
  "worker-1.portal-renterd-cluster.node.testing.pinner.xyz",
]

```
</details>
</details>